Algo_4.1.html
<!doctype html>
<html lang="en">
<head>
<title>Algorithm Analysis Tools 1111</title>
<!-- 2017-08-19 Sat 11:11 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Anghelo De La Cruz">
<link rel="stylesheet" href="css/worg.css" type="text/css" media="screen" />

</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">Algorithm Analysis Tools 1111</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Algorithm Analysis Tools</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Mathematical Theory</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Summation Notation</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Summation is the addition of numbers and is
specified by a rule defined in the notation using the upper case Greek
letter sigma \(\sum\).
</p>

<p>
\(\sum_{i=1}^{n} i = 1 + 2 + 3 + \dots + n\)
</p>

<ul class="org-ul">
<li>i is the index of summation
</li>
<li>1 is the starting point (lower limit ofsummation)
</li>
<li>n is the stopping point (upper limit of summation)
</li>
<li>i is the summation element
</li>
</ul>

<p>
When we use the summation symbol, it is useful to remember the following rules:
</p>

\begin{align*}
\end{align*}
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Double Sum</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
In certain situations, using a double sum may be necessary.
</p>


<p>
which can be visualised as the sum of items of matrix:
</p>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> Double Index</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
To represent the data of a table or a matrix, double index notation is
commonly used. Where \(x_{ij}\) corresponds to the $i$th row and the
$j$th column item.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Recurrence Relations</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Arithmetic Sequence</h3>
<div class="outline-text-3" id="text-2-1">
<p>
This is a <b>linear</b> changing sequence shown by:
</p>

<p>
<b>Example</b>
</p>
</div>
</div>


<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Geometric Sequence</h3>
<div class="outline-text-3" id="text-2-2">
<p>
This is an <b>exponential</b> changng sequence shown by:
</p>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Proof by Induction</h2>
<div class="outline-text-2" id="text-3">
<p>
There are 4 steps of math induction:
</p>

<ul class="org-ul">
<li>Show \(P(1)\)
</li>
<li>Assume \(P(k)\)
</li>
<li>Show \(P(k) \rightarrow P(k+1)\)
</li>
</ul>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Algorithm Analysis Tools</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. Mathematical Theory</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Recurrence Relations</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. Arithmetic Sequence</a></li>
<li><a href="#sec-2-2">2.2. Geometric Sequence</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Proof by Induction</a></li>
</ul>
</div>
</nav>
</div></div></div>
</body>
</html>
