Algo_4.1.tex
% Created 2017-08-18 Fri 16:48
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Anghelo De La Cruz}
\date{\today}
\title{Algorithm Analysis Tools}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.2.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents


\section{Mathematical Theory}
\label{sec-1}

\subsection{Summation Notation}
\label{sec-1-1}

Summation is the addition of numbers and is
specified by a rule defined in the notation using the upper case Greek
letter sigma $\sum$.

$\sum_{i=1}^{n} i = 1 + 2 + 3 + \dots + n$

\begin{itemize}
\item i is the index of summation
\item 1 is the starting point (lower limit ofsummation)
\item n is the stopping point (upper limit of summation)
\item i is the summation element
\end{itemize}

When we use the summation symbol, it is useful to remember the following rules:

\begin{align*}

\end{align*}

\subsection{Double Sum}
\label{sec-1-2}

In certain situations, using a double sum may be necessary.


which can be visualised as the sum of items of matrix:

\subsection{Double Index}
\label{sec-1-3}

To represent the data of a table or a matrix, double index notation is
commonly used. Where $x_{ij}$ corresponds to the \$i\$th row and the
\$j\$th column item.

\section{Recurrence Relations}
\label{sec-2}

\subsection{Arithmetic Sequence}
\label{sec-2-1}

This is a \textbf{linear} changing sequence shown by:

\textbf{Example}


\subsection{Geometric Sequence}
\label{sec-2-2}

This is an \textbf{exponential} changng sequence shown by:


\section{Proof by Induction}
\label{sec-3}

There are 4 steps of math induction:

\begin{itemize}
\item Show $P(1)$
\item 
\end{itemize}
% Emacs 25.2.1 (Org mode 8.2.10)
\end{document}
